12/data/attachments/1cf3acf7881c31fb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7517b9fd-d6d3-4a46-9355-acf0c1718140</nif:username>
            <nif:friendToBeAdded>Amanda_protect_Friend_27071_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>